# PlanCircuit Properties

---
The PlanCircuit type exposes the following members.
| Name| Description
---|---|---
| Area| The enclosed area of the circuit.
| IsReadOnly| Identifies if the object is read-only or modifiable.(Inherited from APIObject)
| IsRoomLocated| Reports whether there is a room located in this circuit.
| SideNum| The number of sides in the circuit.
Top
#### Reference
PlanCircuit Class
Autodesk.Revit.DB Namespace